# SQL Concepts

Sqlite database is used for querying

SQL flavour: T-SQL

In [ ]:
%load_ext sql

In [63]:
%sql sqlite://

In [64]:
%%sql   

drop table emp;

CREATE TABLE emp
(empid  NUMBER(5),
fname   VARCHAR2(20),
lname   VARCHAR2(20),
sex     VARCHAR2(1),
ssn     VARCHAR2(9),
salary  NUMBER(8),
deptno  NUMBER(5)
);                 

INSERT INTO emp VALUES (501,'JOHN','DOE','M','500000001',30000,4001);
INSERT INTO emp VALUES (502,'JOHN','SMITH','M','500000002',40000,4001);
INSERT INTO emp VALUES (503,'SEAN','LEE','M','500000003',30000,4001);
INSERT INTO emp VALUES (512,'AMRISHAN','VAI','M','500000001',40000,4001);
INSERT INTO emp VALUES (504,'EVAN','SEAN','M','500000004',50000,4002);
INSERT INTO emp VALUES (505,'REBECCA','SEAN','F','500000005',30000,4002);
INSERT INTO emp VALUES (506,'TIM','DUNCAN','M','500000006',30000,4002);
INSERT INTO emp VALUES (507,'ROBERT','DUVAL','M','500000007',30000,4002);
INSERT INTO emp VALUES (508,'CLINT','JOHNSON','M','500000008',30000,4002);
INSERT INTO emp VALUES (509,'SARRAH','MCMILLAN','F','500000009',60000,4003);
INSERT INTO emp VALUES (510,'DAVID','LIMB','M','500000010',30000,4003);
INSERT INTO emp VALUES (511,'DAVID','BOWE','M','500000011',30000,4003);

CREATE TABLE dept
(deptno NUMBER(5)  NOT NULL,
name    VARCHAR2(20) NOT NULL,
building        VARCHAR2(20),
CONSTRAINT pk_deptno PRIMARY KEY (deptno)
);                           




INSERT INTO dept VALUES (4001, 'SHOES', 'BUILDING I');
INSERT INTO dept VALUES (4002, 'WOMAN CLOTHING', 'BUILDING II');
INSERT INTO dept VALUES (4003, 'MEN CLOTHING', 'BUILDING II');
INSERT INTO dept VALUES (4004, 'KITCHEN APPLIANCES', 'MAIN BUILDING');

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
(sqlite3.OperationalError) table dept already exists
[SQL: CREATE TABLE dept
(deptno NUMBER(5)  NOT NULL,
name    VARCHAR2(20) NOT NULL,
building        VARCHAR2(20),
CONSTRAINT pk_deptno PRIMARY KEY (deptno)
);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [65]:
%%sql 
select * from emp;

 * sqlite://
Done.

[(501, 'JOHN', 'DOE', 'M', '500000001', 30000, 4001),
 (502, 'JOHN', 'SMITH', 'M', '500000002', 40000, 4001),
 (503, 'SEAN', 'LEE', 'M', '500000003', 30000, 4001),
 (512, 'AMRISHAN', 'VAI', 'M', '500000001', 40000, 4001),
 (504, 'EVAN', 'SEAN', 'M', '500000004', 50000, 4002),
 (505, 'REBECCA', 'SEAN', 'F', '500000005', 30000, 4002),
 (506, 'TIM', 'DUNCAN', 'M', '500000006', 30000, 4002),
 (507, 'ROBERT', 'DUVAL', 'M', '500000007', 30000, 4002),
 (508, 'CLINT', 'JOHNSON', 'M', '500000008', 30000, 4002),
 (509, 'SARRAH', 'MCMILLAN', 'F', '500000009', 60000, 4003),
 (510, 'DAVID', 'LIMB', 'M', '500000010', 30000, 4003),
 (511, 'DAVID', 'BOWE', 'M', '500000011', 30000, 4003)]

### Window Function

In [76]:
%%sql
select 
    deptno, empid, salary,
    row_number() over(partition by deptno order by salary desc) as row_number,
    dense_rank() over(partition by deptno order by salary desc) as dense_rank,
    rank() over(partition by deptno order by salary desc) as rank,
    avg(salary) over(partition by deptno) as avg_salary,
    max(salary) over(partition by deptno) as max_salary
from emp
order by deptno;

 * sqlite://
Done.

[(4001, 502, 40000, 1, 1, 1, 35000.0, 40000),
 (4001, 512, 40000, 2, 1, 1, 35000.0, 40000),
 (4001, 501, 30000, 3, 2, 3, 35000.0, 40000),
 (4001, 503, 30000, 4, 2, 3, 35000.0, 40000),
 (4002, 504, 50000, 1, 1, 1, 34000.0, 50000),
 (4002, 505, 30000, 2, 2, 2, 34000.0, 50000),
 (4002, 506, 30000, 3, 2, 2, 34000.0, 50000),
 (4002, 507, 30000, 4, 2, 2, 34000.0, 50000),
 (4002, 508, 30000, 5, 2, 2, 34000.0, 50000),
 (4003, 509, 60000, 1, 1, 1, 40000.0, 60000),
 (4003, 510, 30000, 2, 2, 2, 40000.0, 60000),
 (4003, 511, 30000, 3, 2, 2, 40000.0, 60000)]

### Casting

In [67]:
%%sql
SELECT CAST(25.65 AS int);

 * sqlite://
Done.

[(25,)]

In [68]:
%%sql
SELECT  CAST(10.6496 AS int) as trunc1,
         CAST(-10.6496 AS int) as trunc2,
         CAST(10.6496 AS numeric) as round1,
         CAST(-10.6496 AS numeric) as round2;

 * sqlite://
Done.

[(10, -10, 10.6496, -10.6496)]

### Date Functions


SELECT DAY(GETDATE()) AS 'Day';

SELECT getdate();

SELECT DATEDIFF(DAY, 2019-31-01, 2019-01-01);

### Case Statements

In [69]:
%%sql
select 
    deptno, empid, salary,
    dense_rank() over(partition by deptno order by salary desc) as dense_rank,
    case 
    when salary > 30000 then 'top'
    else 'not top'
    end as top_employee
from emp
order by deptno;

 * sqlite://
Done.

[(4001, 502, 40000, 1, 'top'),
 (4001, 512, 40000, 1, 'top'),
 (4001, 501, 30000, 2, 'not top'),
 (4001, 503, 30000, 2, 'not top'),
 (4002, 504, 50000, 1, 'top'),
 (4002, 505, 30000, 2, 'not top'),
 (4002, 506, 30000, 2, 'not top'),
 (4002, 507, 30000, 2, 'not top'),
 (4002, 508, 30000, 2, 'not top'),
 (4003, 509, 60000, 1, 'top'),
 (4003, 510, 30000, 2, 'not top'),
 (4003, 511, 30000, 2, 'not top')]

### Common Table Expressions

In [70]:
%%sql
with cte1 as 
(select 
    deptno, empid, fname, salary,
    dense_rank() over(partition by deptno order by salary desc) as dense_rank
from emp
order by deptno)

select * from cte1 where dense_rank = 1;

 * sqlite://
Done.

[(4001, 502, 'JOHN', 40000, 1),
 (4001, 512, 'AMRISHAN', 40000, 1),
 (4002, 504, 'EVAN', 50000, 1),
 (4003, 509, 'SARRAH', 60000, 1)]

### String Fucntions

SELECT CONCAT('SQL', ' ', 'is', ' ', 'fun!');

SELECT DIFFERENCE('Juice', 'Jucy');

SELECT REPLACE('SQL Tutorial', 'SQL', 'HTML');

SUBSTRING(string, start, length)

SELECT SUBSTRING('SQL Tutorial', 1, 3) AS ExtractString;

SELECT TRIM('     SQL Tutorial!     ') AS TrimmedString;

SELECT TRIM('#! ' FROM '    #SQL Tutorial!    ') AS TrimmedString;

SELECT name, SUBSTRING(name, 1, 1) AS Initial ,
SUBSTRING(name, 3, 2) AS ThirdAndFourthCharacters
FROM sys.databases  
WHERE database_id < 5;

### Lag/Lead

In [75]:
%%sql
select 
    empid, 
    salary, 
    lag(salary, 1) over(order by empid) as lag,
    lead(salary, 1) over(order by empid) as lead
from emp

 * sqlite://
Done.

[(501, 30000, None, 40000),
 (502, 40000, 30000, 30000),
 (503, 30000, 40000, 50000),
 (504, 50000, 30000, 30000),
 (505, 30000, 50000, 30000),
 (506, 30000, 30000, 30000),
 (507, 30000, 30000, 30000),
 (508, 30000, 30000, 60000),
 (509, 60000, 30000, 30000),
 (510, 30000, 60000, 30000),
 (511, 30000, 30000, 40000),
 (512, 40000, 30000, None)]